report/sysbench/TiDB_test/oltp_point_select.txt
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 200
Report intermediate results every 5 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 5s ] thds: 200 tps: 143411.74 qps: 143411.74 (r/w/o: 143411.74/0.00/0.00) lat (ms,99%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 10s ] thds: 200 tps: 143485.36 qps: 143485.36 (r/w/o: 143485.36/0.00/0.00) lat (ms,99%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 15s ] thds: 200 tps: 140167.67 qps: 140167.67 (r/w/o: 140167.67/0.00/0.00) lat (ms,99%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 200 tps: 138624.49 qps: 138624.49 (r/w/o: 138624.49/0.00/0.00) lat (ms,99%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 25s ] thds: 200 tps: 145047.03 qps: 145047.03 (r/w/o: 145047.03/0.00/0.00) lat (ms,99%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 200 tps: 138790.33 qps: 138790.33 (r/w/o: 138790.33/0.00/0.00) lat (ms,99%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 35s ] thds: 200 tps: 138524.51 qps: 138524.51 (r/w/o: 138524.51/0.00/0.00) lat (ms,99%): 7.84 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 200 tps: 135509.50 qps: 135509.50 (r/w/o: 135509.50/0.00/0.00) lat (ms,99%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 45s ] thds: 200 tps: 136930.00 qps: 136930.00 (r/w/o: 136930.00/0.00/0.00) lat (ms,99%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 200 tps: 134298.71 qps: 134298.71 (r/w/o: 134298.71/0.00/0.00) lat (ms,99%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 55s ] thds: 200 tps: 131297.60 qps: 131297.60 (r/w/o: 131297.60/0.00/0.00) lat (ms,99%): 6.79 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 200 tps: 135218.80 qps: 135218.80 (r/w/o: 135218.80/0.00/0.00) lat (ms,99%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 65s ] thds: 200 tps: 139818.59 qps: 139818.59 (r/w/o: 139818.59/0.00/0.00) lat (ms,99%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 200 tps: 144592.18 qps: 144592.18 (r/w/o: 144592.18/0.00/0.00) lat (ms,99%): 6.91 err/s: 0.00 reconn/s: 0.00
[ 75s ] thds: 200 tps: 145432.91 qps: 145432.91 (r/w/o: 145432.91/0.00/0.00) lat (ms,99%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 200 tps: 143310.07 qps: 143310.07 (r/w/o: 143310.07/0.00/0.00) lat (ms,99%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 85s ] thds: 200 tps: 146961.65 qps: 146961.65 (r/w/o: 146961.65/0.00/0.00) lat (ms,99%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 200 tps: 142039.56 qps: 142039.56 (r/w/o: 142039.56/0.00/0.00) lat (ms,99%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 95s ] thds: 200 tps: 141467.33 qps: 141467.33 (r/w/o: 141467.33/0.00/0.00) lat (ms,99%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 200 tps: 140283.64 qps: 140283.64 (r/w/o: 140283.64/0.00/0.00) lat (ms,99%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 105s ] thds: 200 tps: 141380.52 qps: 141380.52 (r/w/o: 141380.52/0.00/0.00) lat (ms,99%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 200 tps: 128865.11 qps: 128865.11 (r/w/o: 128865.11/0.00/0.00) lat (ms,99%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 115s ] thds: 200 tps: 125899.57 qps: 125899.57 (r/w/o: 125899.57/0.00/0.00) lat (ms,99%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 200 tps: 137951.98 qps: 137951.98 (r/w/o: 137951.98/0.00/0.00) lat (ms,99%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 125s ] thds: 200 tps: 141086.72 qps: 141086.72 (r/w/o: 141086.72/0.00/0.00) lat (ms,99%): 8.28 err/s: 0.00 reconn/s: 0.00
[ 130s ] thds: 200 tps: 139566.93 qps: 139566.93 (r/w/o: 139566.93/0.00/0.00) lat (ms,99%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 135s ] thds: 200 tps: 139531.10 qps: 139531.10 (r/w/o: 139531.10/0.00/0.00) lat (ms,99%): 7.98 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 200 tps: 141734.75 qps: 141734.75 (r/w/o: 141734.75/0.00/0.00) lat (ms,99%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 145s ] thds: 200 tps: 143442.79 qps: 143442.79 (r/w/o: 143442.79/0.00/0.00) lat (ms,99%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 150s ] thds: 200 tps: 139388.96 qps: 139388.96 (r/w/o: 139388.96/0.00/0.00) lat (ms,99%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 155s ] thds: 200 tps: 137378.15 qps: 137378.15 (r/w/o: 137378.15/0.00/0.00) lat (ms,99%): 8.43 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 200 tps: 136028.42 qps: 136028.42 (r/w/o: 136028.42/0.00/0.00) lat (ms,99%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 165s ] thds: 200 tps: 137049.81 qps: 137049.81 (r/w/o: 137049.81/0.00/0.00) lat (ms,99%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 170s ] thds: 200 tps: 126592.86 qps: 126592.86 (r/w/o: 126592.86/0.00/0.00) lat (ms,99%): 8.74 err/s: 0.00 reconn/s: 0.00
[ 175s ] thds: 200 tps: 131251.72 qps: 131251.72 (r/w/o: 131251.72/0.00/0.00) lat (ms,99%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 200 tps: 141031.34 qps: 141031.34 (r/w/o: 141031.34/0.00/0.00) lat (ms,99%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 185s ] thds: 200 tps: 141179.66 qps: 141179.66 (r/w/o: 141179.66/0.00/0.00) lat (ms,99%): 7.56 err/s: 0.00 reconn/s: 0.00
[ 190s ] thds: 200 tps: 141387.47 qps: 141387.47 (r/w/o: 141387.47/0.00/0.00) lat (ms,99%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 195s ] thds: 200 tps: 140174.60 qps: 140174.60 (r/w/o: 140174.60/0.00/0.00) lat (ms,99%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 200 tps: 140984.87 qps: 140984.87 (r/w/o: 140984.87/0.00/0.00) lat (ms,99%): 8.58 err/s: 0.00 reconn/s: 0.00
[ 205s ] thds: 200 tps: 146966.28 qps: 146966.28 (r/w/o: 146966.28/0.00/0.00) lat (ms,99%): 6.55 err/s: 0.00 reconn/s: 0.00
[ 210s ] thds: 200 tps: 147838.09 qps: 147838.09 (r/w/o: 147838.09/0.00/0.00) lat (ms,99%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 215s ] thds: 200 tps: 144210.13 qps: 144210.13 (r/w/o: 144210.13/0.00/0.00) lat (ms,99%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 200 tps: 145379.34 qps: 145379.34 (r/w/o: 145379.34/0.00/0.00) lat (ms,99%): 8.13 err/s: 0.00 reconn/s: 0.00
[ 225s ] thds: 200 tps: 142880.65 qps: 142880.65 (r/w/o: 142880.65/0.00/0.00) lat (ms,99%): 7.70 err/s: 0.00 reconn/s: 0.00
[ 230s ] thds: 200 tps: 137094.47 qps: 137094.47 (r/w/o: 137094.47/0.00/0.00) lat (ms,99%): 7.30 err/s: 0.00 reconn/s: 0.00
[ 235s ] thds: 200 tps: 144789.20 qps: 144789.20 (r/w/o: 144789.20/0.00/0.00) lat (ms,99%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 200 tps: 151197.55 qps: 151197.55 (r/w/o: 151197.55/0.00/0.00) lat (ms,99%): 6.32 err/s: 0.00 reconn/s: 0.00
[ 245s ] thds: 200 tps: 150830.56 qps: 150830.56 (r/w/o: 150830.56/0.00/0.00) lat (ms,99%): 5.57 err/s: 0.00 reconn/s: 0.00
[ 250s ] thds: 200 tps: 149655.90 qps: 149655.90 (r/w/o: 149655.90/0.00/0.00) lat (ms,99%): 7.17 err/s: 0.00 reconn/s: 0.00
[ 255s ] thds: 200 tps: 148383.52 qps: 148383.52 (r/w/o: 148383.52/0.00/0.00) lat (ms,99%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 200 tps: 152570.85 qps: 152570.85 (r/w/o: 152570.85/0.00/0.00) lat (ms,99%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 265s ] thds: 200 tps: 146326.13 qps: 146326.13 (r/w/o: 146326.13/0.00/0.00) lat (ms,99%): 7.43 err/s: 0.00 reconn/s: 0.00
[ 270s ] thds: 200 tps: 150773.86 qps: 150773.86 (r/w/o: 150773.86/0.00/0.00) lat (ms,99%): 6.09 err/s: 0.00 reconn/s: 0.00
[ 275s ] thds: 200 tps: 152598.97 qps: 152598.97 (r/w/o: 152598.97/0.00/0.00) lat (ms,99%): 5.47 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 200 tps: 152209.69 qps: 152209.69 (r/w/o: 152209.69/0.00/0.00) lat (ms,99%): 5.88 err/s: 0.00 reconn/s: 0.00
[ 285s ] thds: 200 tps: 147045.91 qps: 147045.91 (r/w/o: 147045.91/0.00/0.00) lat (ms,99%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 290s ] thds: 200 tps: 146994.57 qps: 146994.57 (r/w/o: 146994.57/0.00/0.00) lat (ms,99%): 5.28 err/s: 0.00 reconn/s: 0.00
[ 295s ] thds: 200 tps: 138772.90 qps: 138772.70 (r/w/o: 138772.70/0.00/0.00) lat (ms,99%): 6.43 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 200 tps: 154699.42 qps: 154699.62 (r/w/o: 154699.62/0.00/0.00) lat (ms,99%): 5.28 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            42542587
        write:                           0
        other:                           0
        total:                           42542587
    transactions:                        42542587 (141795.74 per sec.)
    queries:                             42542587 (141795.74 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          300.0259s
    total number of events:              42542587

Latency (ms):
         min:                                    0.29
         avg:                                    1.41
         max:                                  402.50
         99th percentile:                        7.56
         sum:                             59979779.28

Threads fairness:
    events (avg/stddev):           212712.9350/512.30
    execution time (avg/stddev):   299.8989/0.00